#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/TacoTuesday-RobO/fullBodyCastTheo/runs/run-yxiUYsRPLwLd4M5i

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.aws_acm_certificate.cert: Refreshing...
data.aws_route53_zone.main: Refreshing...
data.aws_route53_zone.main: Refresh complete after 1s [id=Z01703523JOYV2ZE2SFSY]
data.aws_acm_certificate.cert: Refresh complete after 1s [id=arn:aws:acm:us-west-2:359176157131:certificate/f1e3bbff-db3f-43d9-9179-e5aa92b31a98]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_public_key.MyLinuxBox will be read during apply
 <= data "tls_public_key" "MyLinuxBox" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # aws_autoscaling_attachment.tacoTuesday_asg_attachment_443 will be created
  + resource "aws_autoscaling_attachment" "tacoTuesday_asg_attachment_443" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_attachment.tacoTuesday_asg_attachment_80 will be created
  + resource "aws_autoscaling_attachment" "tacoTuesday_asg_attachment_80" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.tacoTuesday_asg_443 will be created
  + resource "aws_autoscaling_group" "tacoTuesday_asg_443" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 3
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "tacoTuesday-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "tacoTuesday_443"
        }
    }

  # aws_autoscaling_group.tacoTuesday_asg_80 will be created
  + resource "aws_autoscaling_group" "tacoTuesday_asg_80" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 3
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "tacoTuesday-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "tacoTuesday_80"
        }
    }

  # aws_autoscaling_policy.tacoTuesday_scaling_policy_443 will be created
  + resource "aws_autoscaling_policy" "tacoTuesday_scaling_policy_443" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "tacoTuesday-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_autoscaling_policy.tacoTuesday_scaling_policy_80 will be created
  + resource "aws_autoscaling_policy" "tacoTuesday_scaling_policy_80" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "tacoTuesday-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "tacoTuesday_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "tacoTuesday_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.tacoTuesday-LT-443 will be created
  + resource "aws_launch_template" "tacoTuesday-LT-443" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-046b5b8111c19b3ac"
      + instance_type          = "t2.micro"
      + key_name               = "MyLinuxBox"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "tacoTuesday-LT-443"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBwb3J0IDQ0MyBFQzIgaW5zdGFuY2U8L3RpdGxlPgo8L2hlYWQ+Cjxib2R5Pgo8ZGl2Pgo8aDE+Q2xhc3MgNiBpcyBzZWN1cmU8L2gxPgo8aDE+U2hlJ3MgY29va2luZyB5b3UgdGFjb3MsIHNvbWV3aGVyZSBpbiBPcmVnb248L2gxPgo8ZGl2IGNsYXNzPSJ0ZW5vci1naWYtZW1iZWQiIGRhdGEtcG9zdGlkPSIyMDQ0OTM3NyIgZGF0YS1zaGFyZS1tZXRob2Q9Imhvc3QiIGRhdGEtYXNwZWN0LXJhdGlvPSIwLjU2MjUiIGRhdGEtd2lkdGg9IjQwJSI+PGEgaHJlZj0iaHR0cHM6Ly90ZW5vci5jb20vdmlldy9hYmVsbDQ2cy1yZWZhY2Utc2V4eS1zZW5zdWFsLXNlZHVjdGl2ZS1naWYtMjA0NDkzNzciPkFiZWxsNDZzIFJlZmFjZSBHSUY8L2E+ZnJvbSA8YSBocmVmPSJodHRwczovL3Rlbm9yLmNvbS9zZWFyY2gvYWJlbGw0NnMtZ2lmcyI+QWJlbGw0NnMgR0lGczwvYT48L2Rpdj4gPHNjcmlwdCB0eXBlPSJ0ZXh0L2phdmFzY3JpcHQiIGFzeW5jIHNyYz0iaHR0cHM6Ly90ZW5vci5jb20vZW1iZWQuanMiPjwvc2NyaXB0Pgo8YnI+CjxoMT5UaGVvJ3MgdGFjbyBsYWRpZXMuLi48L2gxPgo8ZGl2IGNsYXNzPSJ0ZW5vci1naWYtZW1iZWQiIGRhdGEtcG9zdGlkPSIxMzkxMzYxMCIgZGF0YS1zaGFyZS1tZXRob2Q9Imhvc3QiIGRhdGEtYXNwZWN0LXJhdGlvPSIxLjIzOTMyIiBkYXRhLXdpZHRoPSI0MCUiPjxhIGhyZWY9Imh0dHBzOi8vdGVub3IuY29tL3ZpZXcvcmluZy1naXJscy11a3JhaW5lLSVEMSU4MyVEMCVCQSVEMSU4MCVEMCVCMCVEMCVCOCVEMCVCRCVEMCVCMC1sb21hY2hlbmtvLXRvcC1yYW5rLWdpZi0xMzkxMzYxMCI+UmluZyBHaXJscyBVa3JhaW5lIEdJRjwvYT5mcm9tIDxhIGhyZWY9Imh0dHBzOi8vdGVub3IuY29tL3NlYXJjaC9yaW5nK2dpcmxzLWdpZnMiPlJpbmcgR2lybHMgR0lGczwvYT48L2Rpdj4gPHNjcmlwdCB0eXBlPSJ0ZXh0L2phdmFzY3JpcHQiIGFzeW5jIHNyYz0iaHR0cHM6Ly90ZW5vci5jb20vZW1iZWQuanMiPjwvc2NyaXB0Pgo8YnI+CjxkaXYgY2xhc3M9InRlbm9yLWdpZi1lbWJlZCIgZGF0YS1wb3N0aWQ9IjI1MzczMjcxIiBkYXRhLXNoYXJlLW1ldGhvZD0iaG9zdCIgZGF0YS1hc3BlY3QtcmF0aW89IjAuNTYyNSIgZGF0YS13aWR0aD0iNDAlIj48YSBocmVmPSJodHRwczovL3Rlbm9yLmNvbS92aWV3L3NsYXZhLXVrcmFpbmktdWtyYWluZS11a3JhaW5hLXVrcmFpbmlhbi1naWYtMjUzNzMyNzEiPlNsYXZhIFVrcmFpbmkgR0lGPC9hPmZyb20gPGEgaHJlZj0iaHR0cHM6Ly90ZW5vci5jb20vc2VhcmNoL3NsYXZhLWdpZnMiPlNsYXZhIEdJRnM8L2E+PC9kaXY+IDxzY3JpcHQgdHlwZT0idGV4dC9qYXZhc2NyaXB0IiBhc3luYyBzcmM9Imh0dHBzOi8vdGVub3IuY29tL2VtYmVkLmpzIj48L3NjcmlwdD4KPHA+PGI+SW5zdGFuY2UgTmFtZTo8L2I+ICQoaG9zdG5hbWUgLWYpIDwvcD4KPHA+PGI+SW5zdGFuY2UgUHJpdmF0ZSBJcCBBZGRyZXNzOiA8L2I+ICRsb2NhbF9pcHY0PC9wPgo8cD48Yj5BdmFpbGFiaWxpdHkgWm9uZTogPC9iPiAkYXo8L3A+CjxwPjxiPlZpcnR1YWwgUHJpdmF0ZSBDbG91ZCAoVlBDKTo8L2I+ICR2cGM8L3A+CjwvZGl2Pgo8L2JvZHk+CjwvaHRtbD4KSFRNTAoKIyBDbGVhbiB1cCB0aGUgdGVtcCBmaWxlcwpybSAtZiAvdG1wL2xvY2FsX2lwdjQgL3RtcC9heiAvdG1wL21hY2lkCg=="
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "tacoTuesday-LT-443"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_launch_template.tacoTuesday-LT-80 will be created
  + resource "aws_launch_template" "tacoTuesday-LT-80" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-046b5b8111c19b3ac"
      + instance_type          = "t2.micro"
      + key_name               = "MyLinuxBox"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "tacoTuesday-LT-80"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBwb3J0IDgwIEVDMiBpbnN0YW5jZTwvdGl0bGU+CjwvaGVhZD4KPGJvZHk+CjxkaXY+CjxoMT5UYWNvIFRydWNrIFRyb3VwZTwvaDE+CjxoMT5UcnVja3MgcGFya2VkIGluIHBvcnQgODAgaW4gT3JlZ29uPC9oMT4KPGRpdiBjbGFzcz0idGVub3ItZ2lmLWVtYmVkIiBkYXRhLXBvc3RpZD0iMTI2MzQwOTgiIGRhdGEtc2hhcmUtbWV0aG9kPSJob3N0IiBkYXRhLWFzcGVjdC1yYXRpbz0iMi4xODQ5MyIgZGF0YS13aWR0aD0iNDAlIj48YSBocmVmPSJodHRwczovL3Rlbm9yLmNvbS92aWV3L2Z1bm55LW1lbWUtdGFjby1kYXktdG8tdGhlLXRhY28tdHJ1Y2stZ2lmLTEyNjM0MDk4Ij5GdW5ueSBNZW1lIFRhY28gRGF5IEdJRjwvYT5mcm9tIDxhIGhyZWY9Imh0dHBzOi8vdGVub3IuY29tL3NlYXJjaC9mdW5ueSttZW1lLWdpZnMiPkZ1bm55IE1lbWUgR0lGczwvYT48L2Rpdj4gPHNjcmlwdCB0eXBlPSJ0ZXh0L2phdmFzY3JpcHQiIGFzeW5jIHNyYz0iaHR0cHM6Ly90ZW5vci5jb20vZW1iZWQuanMiPjwvc2NyaXB0Pgo8cD48Yj5JbnN0YW5jZSBOYW1lOjwvYj4gJChob3N0bmFtZSAtZikgPC9wPgo8cD48Yj5JbnN0YW5jZSBQcml2YXRlIElwIEFkZHJlc3M6IDwvYj4gJGxvY2FsX2lwdjQ8L3A+CjxwPjxiPkF2YWlsYWJpbGl0eSBab25lOiA8L2I+ICRhejwvcD4KPHA+PGI+VmlydHVhbCBQcml2YXRlIENsb3VkIChWUEMpOjwvYj4gJHZwYzwvcD4KPC9kaXY+CjwvYm9keT4KPC9odG1sPgpIVE1MCgojIENsZWFuIHVwIHRoZSB0ZW1wIGZpbGVzCnJtIC1mIC90bXAvbG9jYWxfaXB2NCAvdG1wL2F6IC90bXAvbWFjaWQK"
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "tacoTuesday-LT-80"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_lb.tacoTuesday_alb will be created
  + resource "aws_lb" "tacoTuesday_alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "tacoTuesday-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name"    = "tacoTuesdayLoadBalancer"
          + "Owner"   = "Chewbacca"
          + "Project" = "Multiapp"
          + "Service" = "Multiapp"
        }
      + tags_all                   = {
          + "Name"    = "tacoTuesdayLoadBalancer"
          + "Owner"   = "Chewbacca"
          + "Project" = "Multiapp"
          + "Service" = "Multiapp"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-west-2:359176157131:certificate/f1e3bbff-db3f-43d9-9179-e5aa92b31a98"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.tacoTuesday_tg_443 will be created
  + resource "aws_lb_target_group" "tacoTuesday_tg_443" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tacoTuesdaytg443"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "tacoTuesday_tg_443"
          + "Owner"   = "Chewbacca"
          + "Project" = "tacoTuesday"
          + "Service" = "tacoTuesday"
        }
      + tags_all                           = {
          + "Name"    = "tacoTuesday_tg_443"
          + "Owner"   = "Chewbacca"
          + "Project" = "tacoTuesday"
          + "Service" = "tacoTuesday"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_lb_target_group.tacoTuesday_tg_80 will be created
  + resource "aws_lb_target_group" "tacoTuesday_tg_80" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tacoTuesday-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "tacoTuesdayTargetGroup80"
          + "Owner"   = "Chewbacca"
          + "Project" = "tacoTuesday"
          + "Service" = "tacoTuesday"
        }
      + tags_all                           = {
          + "Name"    = "tacoTuesdayTargetGroup80"
          + "Owner"   = "Chewbacca"
          + "Project" = "tacoTuesday"
          + "Service" = "tacoTuesday"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
    }

  # aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bomboclaat.click"
      + type            = "A"
      + zone_id         = "Z01703523JOYV2ZE2SFSY"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private"
        }
      + tags_all         = {
          + "Name" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public"
        }
      + tags_all         = {
          + "Name" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-west-2a will be created
  + resource "aws_route_table_association" "private-us-west-2a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-west-2b will be created
  + resource "aws_route_table_association" "private-us-west-2b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-west-2c will be created
  + resource "aws_route_table_association" "private-us-west-2c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-west-2a will be created
  + resource "aws_route_table_association" "public-us-west-2a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-west-2b will be created
  + resource "aws_route_table_association" "public-us-west-2b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-west-2c will be created
  + resource "aws_route_table_association" "public-us-west-2c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.tacoTuesday-LB01-SG01 will be created
  + resource "aws_security_group" "tacoTuesday-LB01-SG01" {
      + arn                    = (known after apply)
      + description            = "tacoTuesday-LB01-SG01"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Secure"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "tacoTuesday-LB01-SG01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "tacoTuesday-LB01-SG01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "tacoTuesday-LB01-SG01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.tacoTuesday-TG01-SG01-80 will be created
  + resource "aws_security_group" "tacoTuesday-TG01-SG01-80" {
      + arn                    = (known after apply)
      + description            = "tacoTuesday-TG01-SG01-80"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "tacoTuesday-TG01-SG01-80"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "tacoTuesday-TG01-SG01-80"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "tacoTuesday-TG01-SG01-80"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.tacoTuesday-TG02-SG01-443 will be created
  + resource "aws_security_group" "tacoTuesday-TG02-SG01-443" {
      + arn                    = (known after apply)
      + description            = "tacoTuesday-TG02-SG01-443"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Secure"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "tacoTuesday-TG02-SG01-443"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "tacoTuesday-TG02-SG01-443"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "tacoTuesday-TG02-SG01-443"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-us-west-2a will be created
  + resource "aws_subnet" "private-us-west-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.18.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-west-2a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-west-2a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-west-2b will be created
  + resource "aws_subnet" "private-us-west-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.18.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-west-2b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-west-2b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-west-2c will be created
  + resource "aws_subnet" "private-us-west-2c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.18.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-west-2c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-west-2c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-west-2a will be created
  + resource "aws_subnet" "public-us-west-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.18.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-west-2a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-west-2a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-west-2b will be created
  + resource "aws_subnet" "public-us-west-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.18.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-west-2b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-west-2b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-west-2c will be created
  + resource "aws_subnet" "public-us-west-2c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.18.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-west-2c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-west-2c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.tacoTuesday will be created
  + resource "aws_vpc" "tacoTuesday" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.18.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "tacoTuesday"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
      + tags_all                             = {
          + "Name"    = "tacoTuesday"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
    }

  # tls_private_key.MyLinuxBox will be created
  + resource "tls_private_key" "MyLinuxBox" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_dns_name      = (known after apply)
  + private_key      = (sensitive value)
  + public_key       = (known after apply)
  + website_dns_name = "https://bomboclaat.click"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rofoed01, Action: `pull_request`*